Tekla Open API Reference for Tekla Structures 2025
ElementBase Methods
The ElementBase type exposes the following members.
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
GetUnformattedString
 Returns the content as a string without formatting.
IsEqual
 Compares the current object with the given object. Checks every field of both objects for equality.
Top
See Also
Reference
ElementBase Class
Tekla.Structures.Drawing Namespace